#include "funcs.cpp"


int main()
{
SystemInfo tst;
bool flag = true;
char ch='y';
while(flag)
	{
	if(ch=='y')
	{
		system("clear");
		printf("***System Info***\n\n");
		
		//-------Раздел вывода имен компьютера и пользователя--------
		
		tst.Names();
		
			
		//---------------------Раздел вывода версии ОС-------------------
		
		tst.Version();
		
		//--------------Раздел вывода информации о процессоре----------------
		
		tst.Processors();
		
		//------------------Вывод информации о памяти--------------------
		
		tst.Memory();
		
		//------------Вывод информации о сетевых адаптерах-----------------
		tst.Adapters();
		
		//----------------Вывод информации о дисках---------
		
		tst.Discs();
		
		//----------------Вывод информации о языке---------------
		
		tst.Language();
		
		//-------------Вывод информации о дате и времени---------------
		
		tst.Data();
		
		
		//-------------Вывод информации об экране---------------
		
		tst.Screen();
		
		
		
		cout << "Update?(y - yes, another key - no): ";
		cin >> ch;
	}
	else
	{
		flag = false;
	}
}
}
